package 김기수_03;
//문제 3. 정수 배열에서 최대값과 최소값을 출력하는 메소드를 작성하려고한다. (20점)
//
//코드 작성없이 한글로 로직구성만 하되, 메소드 정의 방법에 따라 순서 맞춰 작성하세요.
public class MaxMin {
	//리턴타입 보이드 넣고 메소드명(배열)로 메소드 만들기
			//void 메소드명(배열){
//			for조건문(i=0;i<배열길이;i++){
//				최대값 담을 정수형 변수 max 선언
//				if조건문 (ar[i]>ar[i+1]){
//				max에 ar[i]값 넣고
//				}else{
//				max에 ar[i+1]값넣기
//				}
//			for조건문(i=0;i<배열길이;i++){
//				최소값 담을 정수형 변수 min 선언
//				if조건문 (ar[i]<ar[i+1]){
//				min에 ar[i]값 넣고
//				}else{
//				min에 ar[i+1]값넣기
//				}
//   		}
	
		 
		 
		
		
	}
		
		
		

	


